#include<stdio.h>


int main3() {
	char ch = 'a';
	
	/******************************************************************/

	//&ch
	char* cp = &ch;//右&ch表示ch的地址
	//左&ch是非法的,左&ch表示地址，但自身没有地址

	/******************************************************************/

	//ch
	char ch1 = ch;//右ch表示'a'
	ch = 'a';//左ch为ch的地址

	/*****************************************************************/

	//cp
	int address = cp;//右cp表示ch的地址
	printf("cp = %d\n", address);
	cp = &ch;//左cp为cp的地址

	/*****************************************************************/

	//&cp
	int** cpcp = &cp;//右&cp表示cp的地址，注意指向指针的指针
	//左&cp是非法的，左&cp表示地址，但自身没有地址

	/*****************************************************************/

	//*cp
	char b = *cp;//右*cp表示'a'
	*cp = 'a';//左*cp为ch地址

	/*****************************************************************/

	//*cp+1(注：先执行*)
	char c = *cp + 1;//右*cp+1表示'a'+1,为'b'
	printf("*cp + 1 = %c\n", c);
	//左*cp+1是非法的，自身没有地址

	/*****************************************************************/

	
	char chs[3] = { 'a','b','c' };
	char* sp = &chs[0];

	//*(sp+1)
	char d = *(sp + 1);//右*(sp+1)表示chs[0]后一个位置（chs[1]）存储的值
	printf("* (sp + 1) = %c\n", d);
	*(sp + 1) = 'b';//左*(sp+1)为chs[1]的地址

	/*****************************************************************/

	//++sp
	int e = ++sp;//右++sp表示chs[1]的地址,先加再拷贝
	printf("++sp = %d\n", e);
	//左++sp是非法的，左++sp表示地址，但自身没有地址

	/*****************************************************************/

	//sp++
	sp = &chs[0];//还原
	int f = sp++;//右sp++表示chs[0]的地址,先拷贝再加
	printf("sp++ = %d\n", f);
	//左sp++是非法的，左sp++表示地址，但自身没有地址

	/*****************************************************************/

	//*++sp
	sp = &chs[0];//还原
	char g = *++sp;//右*++sp表示chs[1]的值'b'
	printf("*++sp = %c\n", g);
	*++sp = 'c';//左*++sp为chs[2]的地址
	//*sp++同理

	/*****************************************************************/

	//++*sp
	sp = &chs[0];//还原
	char h = ++ * sp;//右++*sp表示++('a')即'b'
	printf("++*sp = %c\n", h);
	//左++*sp是非法的，自身没有地址
	//(*sp)++同理

	/*****************************************************************/

	//++*++sp
	*sp = 'a';//还原
	char i = ++ * ++sp;//右++*++sp表示++'b'，即'c'
	printf("++*++sp = %c\n", i);
	//左++*++sp是非法的，自身没有地址
	//++*sp++同理，为'b'(注：先执行sp++)

	/*****************************************************************/

	//补充
	sp = &chs[0];//还原
	char* sp1 = &chs[1];
	ptrdiff_t n = sp1 - sp;//ptrdiff_t 是有符号整数类型
	//两个指针需要指向同一个数组中的元素
	printf("sp1 - sp = %d\n", n);




	return 0;
}